OpenNuvoton/M55M1BSP/Library/StdDriver/src/lpi2c.c
/**************************************************************************//**
 * @file     lpi2c.c
 * @version  V1.00
 * @brief    LPI2C driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup LPI2C_Driver I2C Driver
  @{
*/

/** @addtogroup LPI2C_EXPORTED_FUNCTIONS I2C Exported Functions
  @{
*/

int32_t g_LPI2C_i32ErrCode = 0;       /*!< LPI2C global error code */

/**
  * @brief      Enable specify I2C Controller and set Clock Divider
  *
  * @param[in]  i2c         Specify I2C port
  * @param[in]  u32BusClock The target I2C bus clock in Hz
  *
  * @return     Actual I2C bus clock frequency
  *
  * @details    The function enable the specify I2C Controller and set proper Clock Divider
  *             in I2C CLOCK DIVIDED REGISTER (I2CLK) according to the target I2C Bus clock.
  *             I2C Bus clock = PCLK / (4*(divider+1)).
  *
  */
uint32_t LPI2C_Open(LPI2C_T *i2c, uint32_t u32BusClock)
{
    uint32_t u32Div;
    uint32_t u32Pclk = CLK_GetPCLK4Freq();
    u32Div = (uint32_t)(((((u32Pclk * 10U) / (u32BusClock * 4U)) + 5U) / 10U) - 1U); /* Compute proper divider for I2C clock */
    i2c->CLKDIV = u32Div;

    /* Enable I2C */
    i2c->CTL0 |= LPI2C_CTL0_LPI2CEN_Msk;

    return (u32Pclk / ((u32Div + 1U) << 2U));
}

/**
  * @brief      Disable specify I2C Controller
  *
  * @param[in]  i2c         Specify I2C port
  *
  * @details    Reset I2C Controller and disable specify I2C port.
  *
  */

void LPI2C_Close(LPI2C_T *i2c)
{
    uint32_t u32IsRegLocked;
    u32IsRegLocked = SYS_IsRegLocked();

    if (u32IsRegLocked)
    {
        SYS_UnlockReg();
    }

    /* Reset I2C Controller */
    SYS->LPI2CRST |= SYS_LPI2CRST_LPI2C0RST_Msk;
    SYS->LPI2CRST &= ~SYS_LPI2CRST_LPI2C0RST_Msk;

    /* Disable I2C */
    i2c->CTL0 &= ~LPI2C_CTL0_LPI2CEN_Msk;

    if (u32IsRegLocked)
    {
        SYS_LockReg();
    }
}

/**
  * @brief      Clear Time-out Counter flag
  *
  * @param[in]  i2c         Specify I2C port
  *
  * @details    When Time-out flag will be set, use this function to clear I2C Bus Time-out counter flag .
  *
  */
void LPI2C_ClearTimeoutFlag(LPI2C_T *i2c)
{
    i2c->TOCTL |= LPI2C_TOCTL_TOIF_Msk;
}

/**
  * @brief      Set Control bit of I2C Controller
  *
  * @param[in]  i2c         Specify I2C port
  * @param[in]  u8Start     Set I2C START condition
  * @param[in]  u8Stop      Set I2C STOP condition
  * @param[in]  u8Si        Clear SI flag
  * @param[in]  u8Ack       Set I2C ACK bit
  *
  * @details    The function set I2C Control bit of I2C Bus protocol.
  *
  */
void LPI2C_Trigger(LPI2C_T *i2c, uint8_t u8Start, uint8_t u8Stop, uint8_t u8Si, uint8_t u8Ack)
{
    uint32_t u32Reg = 0U;

    if (u8Start)
    {
        u32Reg |= LPI2C_CTL_STA;
    }

    if (u8Stop)
    {
        u32Reg |= LPI2C_CTL_STO;
    }

    if (u8Si)
    {
        u32Reg |= LPI2C_CTL_SI;
    }

    if (u8Ack)
    {
        u32Reg |= LPI2C_CTL_AA;
    }

    i2c->CTL0 = (i2c->CTL0 & ~0x3CU) | u32Reg;
}

/**
  * @brief      Disable Interrupt of I2C Controller
  *
  * @param[in]  i2c         Specify I2C port
  *
  * @details    The function is used for disable I2C interrupt
  *
  */
void LPI2C_DisableInt(LPI2C_T *i2c)
{
    i2c->CTL0 &= ~LPI2C_CTL0_INTEN_Msk;
}

/**
  * @brief      Enable Interrupt of I2C Controller
  *
  * @param[in]  i2c         Specify I2C port
  *
  * @details    The function is used for enable I2C interrupt
  *
  */
void LPI2C_EnableInt(LPI2C_T *i2c)
{
    i2c->CTL0 |= LPI2C_CTL0_INTEN_Msk;
}

/**
 * @brief      Get I2C Bus Clock
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     The actual I2C Bus clock in Hz
 *
 * @details    To get the actual I2C Bus Clock frequency.
 */
uint32_t LPI2C_GetBusClockFreq(const LPI2C_T *i2c)
{
    uint32_t u32Divider = i2c->CLKDIV;
    uint32_t u32Pclk = CLK_GetPCLK4Freq();
    return (u32Pclk / ((u32Divider + 1U) << 2U));
}

/**
 * @brief      Set I2C Bus Clock
 *
 * @param[in]  i2c          Specify I2C port
 * @param[in]  u32BusClock  The target I2C Bus Clock in Hz
 *
 * @return     The actual I2C Bus Clock in Hz
 *
 * @details    To set the actual I2C Bus Clock frequency.
 */
uint32_t LPI2C_SetBusClockFreq(LPI2C_T *i2c, uint32_t u32BusClock)
{
    uint32_t u32Div;

    uint32_t u32Pclk = CLK_GetPCLK4Freq();
    u32Div = (uint32_t)(((((u32Pclk * 10U) / (u32BusClock * 4U)) + 5U) / 10U) - 1U); /* Compute proper divider for I2C clock */
    i2c->CLKDIV = u32Div;
    return (u32Pclk / ((u32Div + 1U) << 2U));
}

/**
 * @brief      Get Interrupt Flag
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     I2C interrupt flag status
 *
 * @details    To get I2C Bus interrupt flag.
 */
uint32_t LPI2C_GetIntFlag(const LPI2C_T *i2c)
{
    uint32_t u32Value;

    if ((i2c->CTL0 & LPI2C_CTL0_SI_Msk) == LPI2C_CTL0_SI_Msk)
    {
        u32Value = 1U;
    }
    else
    {
        u32Value = 0U;
    }

    return u32Value;
}

/**
 * @brief      Get I2C Bus Status Code
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     I2C Status Code
 *
 * @details    To get I2C Bus Status Code.
 */
uint32_t LPI2C_GetStatus(const LPI2C_T *i2c)
{
    return (i2c->STATUS0);
}

/**
 * @brief      Read a Byte from I2C Bus
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     I2C Data
 *
 * @details    To read a bytes data from specify I2C port.
 */
uint8_t LPI2C_GetData(const LPI2C_T *i2c)
{
    return (uint8_t)(i2c->DAT);
}

/**
 * @brief      Send a byte to I2C Bus
 *
 * @param[in]  i2c          Specify I2C port
 * @param[in]  u8Data       The data to send to I2C bus
 *
 * @details    This function is used to write a byte to specified I2C port
 */
void LPI2C_SetData(LPI2C_T *i2c, uint8_t u8Data)
{
    i2c->DAT = u8Data;
}

/**
 * @brief      Set 7-bit Slave Address and GC Mode
 *
 * @param[in]  i2c          Specify I2C port
 * @param[in]  u8SlaveNo    Set the number of I2C address register (0~3)
 * @param[in]  u8SlaveAddr  7-bit slave address
 * @param[in]  u8GCMode     Enable/Disable GC mode (LPI2C_GCMODE_ENABLE / LPI2C_GCMODE_DISABLE)
 *
 * @details    This function is used to set 7-bit slave addresses in I2C SLAVE ADDRESS REGISTER (I2CADDR0~3)
 *             and enable GC Mode.
 *
 */
void LPI2C_SetSlaveAddr(LPI2C_T *i2c, uint8_t u8SlaveNo, uint8_t u8SlaveAddr, uint8_t u8GCMode)
{
    switch (u8SlaveNo)
    {
        case 1:
            i2c->ADDR1  = ((uint32_t)u8SlaveAddr << 1U) | u8GCMode;
            break;

