OpenNuvoton/M55M1BSP/Library/StdDriver/src/lpi2c.c
        case 2:
            i2c->ADDR2  = ((uint32_t)u8SlaveAddr << 1U) | u8GCMode;
            break;

        case 3:
            i2c->ADDR3  = ((uint32_t)u8SlaveAddr << 1U) | u8GCMode;
            break;

        case 0:
        default:
            i2c->ADDR0  = ((uint32_t)u8SlaveAddr << 1U) | u8GCMode;
            break;
    }
}

/**
 * @brief      Configure the mask bits of 7-bit Slave Address
 *
 * @param[in]  i2c              Specify I2C port
 * @param[in]  u8SlaveNo        Set the number of I2C address mask register (0~3)
 * @param[in]  u8SlaveAddrMask  A byte for slave address mask
 *
 * @details    This function is used to set 7-bit slave addresses.
 *
 */
void LPI2C_SetSlaveAddrMask(LPI2C_T *i2c, uint8_t u8SlaveNo, uint8_t u8SlaveAddrMask)
{
    switch (u8SlaveNo)
    {
        case 1:
            i2c->ADDRMSK1  = (uint32_t)u8SlaveAddrMask << 1U;
            break;

        case 2:
            i2c->ADDRMSK2  = (uint32_t)u8SlaveAddrMask << 1U;
            break;

        case 3:
            i2c->ADDRMSK3  = (uint32_t)u8SlaveAddrMask << 1U;
            break;

        case 0:
        default:
            i2c->ADDRMSK0  = (uint32_t)u8SlaveAddrMask << 1U;
            break;
    }
}

/**
 * @brief      Enable Time-out Counter Function and support Long Time-out
 *
 * @param[in]  i2c              Specify I2C port
 * @param[in]  u8LongTimeout    Configure DIV4 to enable Long Time-out (0/1)
 *
 * @details    This function enable Time-out Counter function and configure DIV4 to support Long
 *             Time-out.
 *
 */
void LPI2C_EnableTimeout(LPI2C_T *i2c, uint8_t u8LongTimeout)
{
    if (u8LongTimeout)
    {
        i2c->TOCTL |= LPI2C_TOCTL_TOCDIV4_Msk;
    }
    else
    {
        i2c->TOCTL &= ~LPI2C_TOCTL_TOCDIV4_Msk;
    }

    i2c->TOCTL |= LPI2C_TOCTL_TOCEN_Msk;
}

/**
 * @brief      Disable Time-out Counter Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @details    To disable Time-out Counter function in I2CTOC register.
 *
 */
void LPI2C_DisableTimeout(LPI2C_T *i2c)
{
    i2c->TOCTL &= ~LPI2C_TOCTL_TOCEN_Msk;
}

/**
 * @brief      Enable I2C Wake-up Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @details    To enable Wake-up function of I2C Wake-up control register.
 *
 */
void LPI2C_EnableWakeup(LPI2C_T *i2c)
{
    i2c->WKCTL |= LPI2C_WKCTL_WKEN_Msk;
}

/**
 * @brief      Disable I2C Wake-up Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @details    To disable Wake-up function of I2C Wake-up control register.
 *
 */
void LPI2C_DisableWakeup(LPI2C_T *i2c)
{
    i2c->WKCTL &= ~LPI2C_WKCTL_WKEN_Msk;
}

/**
  * @brief      Write a byte to Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  data            Write a byte data to Slave
  *
  * @retval     0               Write data success
  * @retval     1               Write data fail, or bus occurs error events
  *
  * @details    The function is used for I2C Master write a byte data to Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint8_t LPI2C_WriteByte(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint8_t data)
{
    uint32_t u32txLen = LPI2C_WriteMultiBytes(i2c, u8SlaveAddr, &data, 1);

    if (u32txLen == 1UL)
    {
        return 0; // Write data success
    }
    else
    {
        return 1; // Write data fail, or bus occurs error events
    }
}

/**
  * @brief      Write multi bytes to Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  data[]          Pointer to array to write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master write multi bytes data to Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint32_t LPI2C_WriteMultiBytes(LPI2C_T *i2c, uint8_t u8SlaveAddr, const uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = LPI2C_CTL_SI;
    uint32_t u32txLen = 0u;
    uint32_t u32TimeOutCount;
    g_LPI2C_i32ErrCode = 0;
    LPI2C_START(i2c);                                              /* Send START */

    while (u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = LPI2C_TIMEOUT;
        LPI2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch (LPI2C_GET_STATUS(i2c))
        {
            case 0x08u:
                LPI2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));    /* Write SLA+W to Register I2CDAT */
                u32Ctrl = LPI2C_CTL_SI;                           /* Clear SI */
                break;

            case 0x18u:                                           /* Slave Address ACK */
            case 0x28u:
                if (u32txLen < u32wLen)
                {
                    LPI2C_SET_DATA(i2c, data[u32txLen]);                /* Write Data to I2CDAT */
                    u32txLen++;
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_STO_SI;                   /* Clear SI and send STOP */
                    u8Xfering = 0u;
                }

                break;

            case 0x20u:                                           /* Slave Address NACK */
            case 0x30u:                                           /* Master transmit data NACK */
                u32Ctrl = LPI2C_CTL_STO_SI;                       /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x38u:                                           /* Arbitration Lost */
            default:                                             /* Unknow status */
                LPI2C_SET_CONTROL_REG(i2c, LPI2C_CTL_STO_SI);      /* Clear SI and send STOP */
                u32Ctrl = LPI2C_CTL_SI;
                u8Err = 1u;
                break;
        }

        LPI2C_SET_CONTROL_REG(i2c, u32Ctrl);                        /* Write controlbit to LPI2C_CTL register */
    }

