OpenNuvoton/M55M1BSP/Library/StdDriver/src/lpi2c.c
    u32TimeOutCount = LPI2C_TIMEOUT;

    while ((i2c)->CTL0 & LPI2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;

        if (u32TimeOutCount == 0UL)
        {
            g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32txLen;                                             /* Return bytes length that have been transmitted */
}

/**
  * @brief      Specify a byte register address and write a byte to Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address (1 byte) of data write to
  * @param[in]  data            A byte data to write it to Slave
  *
  * @retval     0               Write data success
  * @retval     1               Write data fail, or bus occurs error events
  *
  * @details    The function is used for I2C Master specify a address that data write to in Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint8_t LPI2C_WriteByteOneReg(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t data)
{
    uint32_t u32txLen = LPI2C_WriteMultiBytesOneReg(i2c, u8SlaveAddr, u8DataAddr, &data, 1);

    if (u32txLen == 1UL)
    {
        return 0; // Write data success
    }
    else
    {
        return 1; // Write data fail, or bus occurs error events
    }
}


/**
  * @brief      Specify a byte register address and write multi bytes to Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address (1 byte) of data write to
  * @param[in]  *data           Pointer to array to write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes write to in Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint32_t LPI2C_WriteMultiBytesOneReg(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, const uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = LPI2C_CTL_SI;
    uint32_t u32txLen = 0u;
    uint32_t u32TimeOutCount;
    g_LPI2C_i32ErrCode = 0;
    LPI2C_START(i2c);                                              /* Send START */

    while (u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = LPI2C_TIMEOUT;
        LPI2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch (LPI2C_GET_STATUS(i2c))
        {
            case 0x08u:
                LPI2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));    /* Write SLA+W to Register I2CDAT */
                u32Ctrl = LPI2C_CTL_SI;
                break;

            case 0x18u:                                           /* Slave Address ACK */
                LPI2C_SET_DATA(i2c, u8DataAddr);                   /* Write Lo byte address of register */
                break;

            case 0x20u:                                           /* Slave Address NACK */
            case 0x30u:                                           /* Master transmit data NACK */
                u32Ctrl = LPI2C_CTL_STO_SI;                       /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x28u:
                if (u32txLen < u32wLen)
                {
                    LPI2C_SET_DATA(i2c, data[u32txLen]);
                    u32txLen++;
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_STO_SI;                   /* Clear SI and send STOP */
                    u8Xfering = 0u;
                }

                break;

            case 0x38u:                                           /* Arbitration Lost */
            default:                                             /* Unknow status */
                LPI2C_SET_CONTROL_REG(i2c, LPI2C_CTL_STO_SI);        /* Clear SI and send STOP */
                u32Ctrl = LPI2C_CTL_SI;
                u8Err = 1u;
                break;
        }

        LPI2C_SET_CONTROL_REG(i2c, u32Ctrl);                        /* Write controlbit to LPI2C_CTL register */
    }

    u32TimeOutCount = LPI2C_TIMEOUT;

    while ((i2c)->CTL0 & LPI2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;

        if (u32TimeOutCount == 0UL)
        {
            g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32txLen;                                             /* Return bytes length that have been transmitted */
}

/**
  * @brief      Specify two bytes register address and Write a byte to Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 byte) of data write to
  * @param[in]  data            Write a byte data to Slave
  *
  * @retval     0               Write data success
  * @retval     1               Write data fail, or bus occurs error events
  *
  * @details    The function is used for I2C Master specify two bytes address that data write to in Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint8_t LPI2C_WriteByteTwoRegs(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, uint8_t data)
{
    uint32_t u32txLen = LPI2C_WriteMultiBytesTwoRegs(i2c, u8SlaveAddr, u16DataAddr, &data, 1);

    if (u32txLen == 1UL)
    {
        return 0; // Write data success
    }
    else
    {
        return 1; // Write data fail, or bus occurs error events
    }                                            /* return (Success)/(Fail) status */
}


/**
  * @brief      Specify two bytes register address and write multi bytes to Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data write to
  * @param[in]  data[]          A data array for write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master specify a byte address that multi data write to in Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

