OpenNuvoton/M55M1BSP/Library/StdDriver/src/lpi2c.c
uint32_t LPI2C_WriteMultiBytesTwoRegs(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, const uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint8_t u8Addr = 1u;
    uint32_t u32Ctrl = LPI2C_CTL_SI;
    uint32_t u32txLen = 0u;
    uint32_t u32TimeOutCount;
    g_LPI2C_i32ErrCode = 0;
    LPI2C_START(i2c);                                                         /* Send START */

    while (u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = LPI2C_TIMEOUT;
        LPI2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch (LPI2C_GET_STATUS(i2c))
        {
            case 0x08u:
                LPI2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));               /* Write SLA+W to Register I2CDAT */
                u32Ctrl = LPI2C_CTL_SI;                                      /* Clear SI */
                break;

            case 0x18u:                                                      /* Slave Address ACK */
                LPI2C_SET_DATA(i2c, (uint8_t)((u16DataAddr & 0xFF00u) >> 8u));    /* Write Hi byte address of register */
                break;

            case 0x20u:                                                      /* Slave Address NACK */
            case 0x30u:                                                      /* Master transmit data NACK */
                u32Ctrl = LPI2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x28u:
                if (u8Addr == 1u)
                {
                    LPI2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFu));       /* Write Lo byte address of register */
                    u8Addr = 0u;
                }
                else if ((u32txLen < u32wLen) && (u8Addr == 0u))
                {
                    LPI2C_SET_DATA(i2c, data[u32txLen]);                           /* Write data to Register I2CDAT*/
                    u32txLen++;
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_STO_SI;                              /* Clear SI and send STOP */
                    u8Xfering = 0u;
                }

                break;

            case 0x38u:                                                      /* Arbitration Lost */
            default:                                                        /* Unknow status */
                LPI2C_SET_CONTROL_REG(i2c, LPI2C_CTL_STO_SI);                   /* Clear SI and send STOP */
                u32Ctrl = LPI2C_CTL_SI;
                u8Err = 1u;
                break;
        }

        LPI2C_SET_CONTROL_REG(i2c, u32Ctrl);                                   /* Write controlbit to LPI2C_CTL register */
    }

    u32TimeOutCount = LPI2C_TIMEOUT;

    while ((i2c)->CTL0 & LPI2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;

        if (u32TimeOutCount == 0UL)
        {
            g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32txLen;                                                        /* Return bytes length that have been transmitted */
}

/**
  * @brief      Read a byte from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  *
  * @return     Read a byte data from Slave
  *
  * @details    The function is used for I2C Master to read a byte data from Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint8_t LPI2C_ReadByte(LPI2C_T *i2c, uint8_t u8SlaveAddr)
{
    uint8_t data;

    uint32_t u32rxLen = LPI2C_ReadMultiBytes(i2c, u8SlaveAddr, &data, 1);

    if (u32rxLen == 1UL)
    {
        return data;
    }
    else
    {
        return 0; // Read data fail
    }
}


/**
  * @brief      Read multi bytes from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[out] rdata[]         A data array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master to read multi data bytes from Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint32_t LPI2C_ReadMultiBytes(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = LPI2C_CTL_SI;
    uint32_t u32rxLen = 0u;
    uint32_t u32TimeOutCount;
    g_LPI2C_i32ErrCode = 0;
    LPI2C_START(i2c);

    while (u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = LPI2C_TIMEOUT;
        LPI2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch (LPI2C_GET_STATUS(i2c))
        {
            case 0x08u:
                LPI2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));    /* Write SLA+R to Register I2CDAT */
                u32Ctrl = LPI2C_CTL_SI;                             /* Clear SI */
                break;

            case 0x40u:                                             /* Slave Address ACK */
                if (u32rLen == 1UL)
                {
                    u32Ctrl = LPI2C_CTL_SI;                                /* Clear SI */
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_SI_AA;                          /* Clear SI and set ACK */
                }

                break;

            case 0x48u:                                             /* Slave Address NACK */
                u32Ctrl = LPI2C_CTL_STO_SI;                         /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x50u:
                rdata[u32rxLen] = (unsigned char) LPI2C_GET_DATA(i2c);    /* Receive Data */
                u32rxLen++;

