OpenNuvoton/M55M1BSP/Library/StdDriver/src/lpi2c.c
                if (u32rxLen < (u32rLen - 1u))
                {
                    u32Ctrl = LPI2C_CTL_SI_AA;                             /* Clear SI and set ACK */
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_SI;                                /* Clear SI */
                }

                break;

            case 0x58u:
                rdata[u32rxLen] = (unsigned char) LPI2C_GET_DATA(i2c);    /* Receive Data */
                u32rxLen++;
                u32Ctrl = LPI2C_CTL_STO_SI;                                /* Clear SI and send STOP */
                u8Xfering = 0u;
                break;

            case 0x38u:                                                    /* Arbitration Lost */
            default:                                                      /* Unknow status */
                LPI2C_SET_CONTROL_REG(i2c, LPI2C_CTL_STO_SI);               /* Clear SI and send STOP */
                u32Ctrl = LPI2C_CTL_SI;
                u8Err = 1u;
                break;
        }

        LPI2C_SET_CONTROL_REG(i2c, u32Ctrl);                                 /* Write controlbit to LPI2C_CTL register */
    }

    u32TimeOutCount = LPI2C_TIMEOUT;

    while ((i2c)->CTL0 & LPI2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;

        if (u32TimeOutCount == 0UL)
        {
            g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                                      /* Return bytes length that have been received */
}


/**
  * @brief      Specify a byte register address and read a byte from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address(1 byte) of data read from
  *
  * @return     Read a byte data from Slave
  *
  * @details    The function is used for I2C Master specify a byte address that a data byte read from Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint8_t LPI2C_ReadByteOneReg(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr)
{
    uint8_t data;

    uint32_t u32rxLen = LPI2C_ReadMultiBytesOneReg(i2c, u8SlaveAddr, u8DataAddr, &data, 1);

    if (u32rxLen == 1UL)
    {
        return data;
    }
    else
    {
        return 0; // Read data fail
    }
}

/**
  * @brief      Specify a byte register address and read multi bytes from Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address (1 byte) of data read from
  * @param[out] rdata[]         A data array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes read from Slave.
  *
  * @note       This function sets g_LPI2C_i32ErrCode to LPI2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint32_t LPI2C_ReadMultiBytesOneReg(LPI2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = LPI2C_CTL_SI;
    uint32_t u32rxLen = 0u;
    uint32_t u32TimeOutCount;
    g_LPI2C_i32ErrCode = 0;
    LPI2C_START(i2c);

    while (u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = LPI2C_TIMEOUT;
        LPI2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_LPI2C_i32ErrCode = LPI2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch (LPI2C_GET_STATUS(i2c))
        {
            case 0x08u:
                LPI2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));      /* Write SLA+W to Register I2CDAT */
                u32Ctrl = LPI2C_CTL_SI;                             /* Clear SI */
                break;

            case 0x18u:                                             /* Slave Address ACK */
                LPI2C_SET_DATA(i2c, u8DataAddr);                     /* Write Lo byte address of register */
                break;

            case 0x20u:                                             /* Slave Address NACK */
            case 0x30u:                                             /* Master transmit data NACK */
                u32Ctrl = LPI2C_CTL_STO_SI;                         /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x28u:
                u32Ctrl = LPI2C_CTL_STA_SI;                         /* Send repeat START */
                break;

            case 0x10u:
                LPI2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));    /* Write SLA+R to Register I2CDAT */
                u32Ctrl = LPI2C_CTL_SI;                             /* Clear SI */
                break;

            case 0x40u:                                             /* Slave Address ACK */
                if (u32rLen == 1UL)
                {
                    u32Ctrl = LPI2C_CTL_SI;                         /* Clear SI */
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_SI_AA;                          /* Clear SI and set ACK */
                }

                break;

            case 0x48u:                                             /* Slave Address NACK */
                u32Ctrl = LPI2C_CTL_STO_SI;                         /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x50u:
                rdata[u32rxLen] = (uint8_t) LPI2C_GET_DATA(i2c);   /* Receive Data */
                u32rxLen++;

                if (u32rxLen < (u32rLen - 1u))
                {
                    u32Ctrl = LPI2C_CTL_SI_AA;                      /* Clear SI and set ACK */
                }
                else
                {
                    u32Ctrl = LPI2C_CTL_SI;                         /* Clear SI */
                }

                break;

            case 0x58u:
                rdata[u32rxLen] = (uint8_t) LPI2C_GET_DATA(i2c);   /* Receive Data */
                u32rxLen++;
                u32Ctrl = LPI2C_CTL_STO_SI;                         /* Clear SI and send STOP */
                u8Xfering = 0u;
                break;

            case 0x38u:                                             /* Arbitration Lost */
            default:                                               /* Unknow status */
                LPI2C_SET_CONTROL_REG(i2c, LPI2C_CTL_STO_SI);        /* Clear SI and send STOP */
                u32Ctrl = LPI2C_CTL_SI;
                u8Err = 1u;
                break;
        }

        LPI2C_SET_CONTROL_REG(i2c, u32Ctrl);                          /* Write controlbit to LPI2C_CTL register */
    }

